tap "homebrew/bundle"
brew "mas"

brew "neovim"
brew "rbenv"

cask "firefox"
cask "alacritty"
cask "font-fira-code-nerd-font"
cask "hammerspoon"
cask "keepingyouawake"
cask "raycast"
cask "karabiner-elements"
cask "obsidian"
cask "reader"
cask "chatgpt"

# macOS settings manager
tap "dsully/tap"
brew "macos-defaults"

# Mac App Store apps
mas "Things", id: 904280696
mas "Paprika Recipe Manager 3", id: 1303222628
mas "MoneyWiz", id: 1511185140